ogneyar/ArduinoProjects/Keil/11/RTE/Device/MDR32F9Q2I/MDR32FxQI_rst_clk.c
/**
  ******************************************************************************
  * @file    MDR32FxQI_rst_clk.c
  * @author  Milandr Application Team
  * @version V2.0.2i
  * @date    17/03/2022
  * @brief   This file contains all the RST_CLK firmware functions.
  ******************************************************************************
  * <br><br>
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, MILANDR SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT
  * OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2022 Milandr</center></h2>
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "MDR32FxQI_rst_clk.h"

/** @addtogroup __MDR32FxQI_StdPeriph_Driver MDR32FxQI Standard Peripherial Driver
  * @{
  */

/** @defgroup RST_CLK RST_CLK
  * @{
  */

/** @defgroup RST_CLK_Private_Constants RST_CLK Private Constants
  * @{
  */

/* RCC_CLK registers bit address in the alias region */
#define PERIPH_BASE                 0x40000000
#define PERIPH_BB_BASE              0x42000000
#define RST_CLK_OFFSET              (MDR_RST_CLK_BASE - PERIPH_BASE)
#define BKP_OFFSET                  (MDR_BKP_BASE - PERIPH_BASE)

#define SFR_OFFSET(TP, MOD, SFR)    ((uint32_t) & ((TP*)MOD)->SFR)
#define BB_ADDR(TP, MOD, SFR, BIT)  (PERIPH_BB_BASE + SFR_OFFSET(TP, MOD, SFR)*32 + BIT*4)
#define RST_CLK_BB(SFR, BIT)        BB_ADDR(MDR_RST_CLK_TypeDef, RST_CLK_OFFSET, SFR, BIT)
#define BKP_BB(SFR, BIT)            BB_ADDR(MDR_BKP_TypeDef, BKP_OFFSET, SFR, BIT)

#define FLAG_MASK                   ((uint8_t)0x1F)
#define FLAG_SFR_MASK               ((uint8_t)0xE0)

#define HSI_RDY_MASK                (1 << 23)
#define LSI_RDY_MASK                (1 << 21)
#define LSE_RDY_MASK                (1 << 13)
#define HSE_RDY_MASK                (1 << 2)
#define HSE2_RDY_MASK               (1 << 3)
#define PLLCPU_RDY_MASK             (1 << 1)
#define PLLUSB_RDY_MASK             (1 << 0)
#define PLLCPUMUL_OFFSET            8
#define PLLCPUmulclr                (~(uint32_t)(0x0F << PLLCPUMUL_OFFSET))
#define PLLUSBMUL_OFFSET            4
#define PLLUSBmulclr                (~(uint32_t)(0x0F << PLLUSBMUL_OFFSET))
#define CPU_C1_SELclr               (~(uint32_t)0x03)
#define CPU_C3_SELclr               (~(uint32_t)0x00000F0)
#define CPU_HCLK_SELclr             (~(uint32_t)(0x03 << 8))
#define ADC_C12_SELclr              (~(uint32_t)((0x03 << 4) | 0x03))
#define AUC_C12_SELclr              (~(uint32_t)((0x03 << 20) | (0x03 << 16)))
#define AUC_C3_SELclr               (~(uint32_t)((0xF<<24)))
#define ADC_C3_SEL_OFFSET           8
#define ADC_C3_SELclr               (~(uint32_t)(0x0F << ADC_C3_SEL_OFFSET))
#define HSI_SEL_OFFSET              4
#define HSI_SELclr                  (~(uint32_t)(0x0F << HSI_SEL_OFFSET))
#define HSE_SEL_OFFSET              0
#define HSE_SELclr                  (~(uint32_t)(0x0F << HSE_SEL_OFFSET))
#define USB_C1_SELclr               (~(uint32_t)0x03)

#define HSITRIM_OFFSET              24
#define HSITRIM_MASK                ((uint32_t)(0x3F << HSITRIM_OFFSET))

#define HSION_OFFSET                22
#define HSION_MASK                  ((uint32_t)(1 << HSION_OFFSET))

#define LSITRIM_OFFSET              16
#define LSITRIM_MASK                ((uint32_t)(0x1F << LSITRIM_OFFSET))

#define LSION_OFFSET                15
#define LSION_MASK                  ((uint32_t)(1 << LSION_OFFSET))

#if defined(USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
    #define PLLCPUON_BB                 RST_CLK_BB(PLL_CONTROL, 2)
    #define PLLCPURLD_BB                RST_CLK_BB(PLL_CONTROL, 3)
    #define PLLUSBON_BB                 RST_CLK_BB(PLL_CONTROL, 0)
    #define PLLUSBRLD_BB                RST_CLK_BB(PLL_CONTROL, 1)

    #define HSION_BB                    BKP_BB(REG_0F, HSION_OFFSET)
    #define LSION_BB                    BKP_BB(REG_0F, LSION_OFFSET)

    #define CPU_C2_SEL_BB               RST_CLK_BB(CPU_CLOCK, 2)
    #define USB_C2_SEL_BB               RST_CLK_BB(USB_CLOCK, 2)
    #define USB_C3_SEL_BB               RST_CLK_BB(USB_CLOCK, 4)
    #define USB_CLK_EN_BB               RST_CLK_BB(USB_CLOCK, 8)
    #define ADC_CLK_EN_BB               RST_CLK_BB(ADC_MCO_CLOCK, 13)
    #define HSI_RTC_EN_BB               RST_CLK_BB(RTC_CLOCK, 9)
    #define HSE_RTC_EN_BB               RST_CLK_BB(RTC_CLOCK, 8)
    #define CPU_C1_SEL0_BB              RST_CLK_BB(CPU_CLOCK, 0)
    #define CPU_C1_SEL1_BB              RST_CLK_BB(CPU_CLOCK, 1)
    #define USB_C1_SEL0_BB              RST_CLK_BB(USB_CLOCK, 0)
    #define USB_C1_SEL1_BB              RST_CLK_BB(USB_CLOCK, 1)
#endif /* #if defined(USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */

#if defined (USE_MDR32FG16S1QI)
    #define PLL_DSP_RDY_BB              RST_CLK_BB(CLOCK_STATUS, RST_CLK_CLOCK_STATUS_PLL_DSP_RDY_Pos)
    #define PLL_DSP_ON_BB               RST_CLK_BB(PLL_CONTROL, RST_CLK_PLL_CONTROL_PLL_DSP_ON_Pos)
    #define PLL_DSP_RLD_BB              RST_CLK_BB(PLL_CONTROL, RST_CLK_PLL_CONTROL_PLL_DSP_RLD_Pos)

    #define DSP_CLK_EN_BB               RST_CLK_BB(DSP_CLOCK, RST_CLK_DSP_CLOCK_DSP_CLK_EN_Pos)
    #define DSP_CLK_C3_SEL_BB           RST_CLK_BB(DSP_CLOCK, RST_CLK_DSP_CLOCK_DSP_C3_SEL_Pos)
    #define DSP_CLK_C2_SEL_BB           RST_CLK_BB(DSP_CLOCK, RST_CLK_DSP_CLOCK_DSP_C2_SEL_Pos)
#endif /* #if defined (USE_MDR32FG16S1QI) */

/** @} */ /* End of group RST_CLK_Private_Constants */

/** @defgroup RST_CLK_Private_Functions RST_CLK Private Functions
  * @{
  */

/**
  * @brief  Set the RST_CLK clock configuration to the default reset state.
  * @param  None
  * @retval None
  */
void RST_CLK_DeInit(void)
{
    RST_CLK_WarmDeInit();
    /* Reset REG_0F bits to zero but HSION bit */
    RST_CLK_PCLKcmd(RST_CLK_PCLK_BKP, ENABLE);
    MDR_BKP->REG_0F |= (uint32_t)((1 << 22) | (1 << 15)); /* HSION & LSION */
    MDR_BKP->REG_0F &= (uint32_t)((1 << 22) | (1 << 15));
}

/**
  * @brief  Set the RST_CLK clock configuration to the default reset state.
  * @param  None
  * @retval None
  */
void RST_CLK_WarmDeInit(void)
{
    /* Prepare HSI clk */
    RST_CLK_HSIcmd(ENABLE);
    RST_CLK_HSIstatus();
    RST_CLK_CPUclkSelection(RST_CLK_CPUclkHSI);

    /* Reset all MDR_RST_CLK clock registers */
    MDR_RST_CLK->CPU_CLOCK      &= (uint32_t)0x00000000;
    MDR_RST_CLK->PLL_CONTROL    &= (uint32_t)0x00000000;
    MDR_RST_CLK->HS_CONTROL     &= (uint32_t)0x00000000;
    MDR_RST_CLK->USB_CLOCK      &= (uint32_t)0x00000000;
    MDR_RST_CLK->ADC_MCO_CLOCK  &= (uint32_t)0x00000000;
    MDR_RST_CLK->RTC_CLOCK      &= (uint32_t)0x00000000;

