ogneyar/ArduinoProjects/Keil/11/RTE/Device/MDR32F9Q2I/MDR32FxQI_rst_clk.c
    /* Reset all clock but RST_CLK and BKP_CLK bits */
    MDR_RST_CLK->PER_CLOCK = (uint32_t)RST_CLK_PCLK_RST_CLK | RST_CLK_PCLK_BKP;

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32F1QI)
    MDR_RST_CLK->CAN_CLOCK      &= (uint32_t)0x00000000;
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32F1QI) */
    MDR_RST_CLK->TIM_CLOCK      &= (uint32_t)0x00000000;
    MDR_RST_CLK->UART_CLOCK     &= (uint32_t)0x00000000;
    MDR_RST_CLK->SSP_CLOCK      &= (uint32_t)0x00000000;
#if defined (USE_MDR32F1QI)
    MDR_RST_CLK->ETH_CLOCK      &= (uint32_t)0x00000000;
#endif /* #if defined (USE_MDR32F1QI) */
#if defined (USE_MDR32FG16S1QI)
    MDR_RST_CLK->DSP_CLOCK      &= (uint32_t)0x00000000;
    MDR_RST_CLK->SPP2_CLOCK     &= (uint32_t)0x00000000;
#endif /* #if defined (USE_MDR32FG16S1QI) */
}

/**
  * @brief  HSE (High Speed External) clock mode and source selection
  * @param  RST_CLK_HSE - @ref RST_CLK_HSE_Mode - mode selector.
  * @retval None
  */
void RST_CLK_HSEconfig(RST_CLK_HSE_Mode RST_CLK_HSE)
{
    /* Check the parameters */
    assert_param(IS_RST_CLK_HSE(RST_CLK_HSE));

    /* Reset HSEON and HSEBYP bits before configuring the HSE */
    MDR_RST_CLK->HS_CONTROL &= ~((uint32_t)(RST_CLK_HSE_ON | RST_CLK_HSE_Bypass));

    /* Configure HSE (RCC_HSE_OFF is already covered by the code section above) */
    switch (RST_CLK_HSE)
    {
        case RST_CLK_HSE_ON:
            /* Set HSEON bit */
            MDR_RST_CLK->HS_CONTROL |= RST_CLK_HSE_ON;
            break;
    
        case RST_CLK_HSE_Bypass:
            /* Set HSEBYP and HSEON bits */
            MDR_RST_CLK->HS_CONTROL |= RST_CLK_HSE_ON | RST_CLK_HSE_Bypass;
            break;

        default:
            break;
    }
}

/**
  * @brief  HSE clock status
  * @param  None
  * @retval @ref ErrorStatus - SUCCESS if HSE clock is ready, else ERROR
  */
ErrorStatus RST_CLK_HSEstatus(void)
{
    __IO uint32_t startCounter = 0;
    ErrorStatus state;
    FlagStatus flag;

    /* Wait until HSE is ready or time out is occure */
    do
    {
        flag = RST_CLK_GetFlagStatus(RST_CLK_FLAG_HSERDY);
        startCounter++;
    } while ((startCounter < HSEonTimeOut) && (flag == RESET));

    if (RST_CLK_GetFlagStatus(RST_CLK_FLAG_HSERDY) != RESET)
    {
        state = SUCCESS;
    }
    else
    {
        state = ERROR;
    }

    return state;
}


#if defined (USE_MDR32F1QI)
/**
  * @brief   HSE2 (High Speed External 2) clock mode and source selection
  * @warning This function can be used only for MCU MDR32F1QI.
  * @param   RST_CLK_HSE2 - @ref RST_CLK_HSE2_Mode - mode selector.
  * @retval  None
  */
void RST_CLK_HSE2config(RST_CLK_HSE2_Mode RST_CLK_HSE2)
{
    /* Check the parameters */
    assert_param(IS_RST_CLK_HSE2(RST_CLK_HSE2));

    /* Reset HSEON and HSEBYP bits before configuring the HSE */
    MDR_RST_CLK->HS_CONTROL &= ~((uint32_t)(RST_CLK_HSE2_ON | RST_CLK_HSE2_Bypass));

    /* Configure HSE (RCC_HSE_OFF is already covered by the code section above) */
    switch (RST_CLK_HSE2)
    {
        case RST_CLK_HSE2_ON:
            /* Set HSEON bit */
            MDR_RST_CLK->HS_CONTROL |= RST_CLK_HSE2_ON;
            break;

        case RST_CLK_HSE2_Bypass:
            /* Set HSEBYP and HSEON bits */
            MDR_RST_CLK->HS_CONTROL |= RST_CLK_HSE2_ON | RST_CLK_HSE2_Bypass;
            break;

        default:
            break;
    }
}

/**
  * @brief   HSE2 clock status
  * @warning This function can be used only for MCU MDR32F1QI.
  * @param   None
  * @retval  @ref ErrorStatus - SUCCESS if HSE2 clock is ready, else ERROR
  */
ErrorStatus RST_CLK_HSE2status(void)
{
    __IO uint32_t startCounter = 0;
    ErrorStatus state;
    FlagStatus flag;

    /* Wait until HSE2 is ready or time out is occure */
    do {
        flag = RST_CLK_GetFlagStatus(RST_CLK_FLAG_HSE2RDY);
        startCounter++;
    } while ((startCounter < HSE2onTimeOut) && (flag == RESET));

    if (RST_CLK_GetFlagStatus(RST_CLK_FLAG_HSE2RDY) != RESET)
    {
        state = SUCCESS;
    }
    else
    {
        state = ERROR;
    }

    return state;
}
#endif /* #if defined (USE_MDR32F1QI) */

/**
  * @brief  LSE (Low Speed External) clock mode and source selection
  * @param  RST_CLK_LSE - @ref RST_CLK_LSE_Mode - mode selector.
  * @retval None
  */
void RST_CLK_LSEconfig(RST_CLK_LSE_Mode RST_CLK_LSE)
{
    /* Check the parameters */
    assert_param(IS_RST_CLK_LSE(RST_CLK_LSE));

    /* Reset LSEON and LSEBYP bits before configuring the LSE */
    MDR_BKP->REG_0F &= ~((uint32_t)(RST_CLK_LSE_ON | RST_CLK_LSE_Bypass));

    switch (RST_CLK_LSE)
    {
        case RST_CLK_LSE_ON:
            /* Set LSEON bit */
            MDR_BKP->REG_0F |= RST_CLK_LSE_ON;
            break;

        case RST_CLK_LSE_Bypass:
            /* Set LSEBYP and LSEON bits */
            MDR_BKP->REG_0F |= (RST_CLK_LSE_ON | RST_CLK_LSE_Bypass);
            break;

        default:
            break;
    }
}

/**
  * @brief  LSE clock status
  * @param  None
  * @retval @ref ErrorStatus - SUCCESS if LSE clock is ready, else ERROR
  */
ErrorStatus RST_CLK_LSEstatus(void)
{
    __IO uint32_t startCounter = 0;
    ErrorStatus state;
    FlagStatus flag;

    /* Wait until LSE is ready or time out is occure */
    do {
        flag = RST_CLK_GetFlagStatus(RST_CLK_FLAG_LSERDY);
        startCounter++;
    } while ((startCounter < LSEonTimeOut) && (flag == RESET));

    if (RST_CLK_GetFlagStatus(RST_CLK_FLAG_LSERDY) != RESET)
    {
        state = SUCCESS;
    }
    else
    {
        state = ERROR;
    }

    return state;
}

/**
  * @brief  HSI (High Speed Internal) clock mode selection
  * @param  NewState - @ref FunctionalState - mode selector (switch off (DISABLE) or on (ENABLE)).
  * @retval None
  */
void RST_CLK_HSIcmd(FunctionalState NewState)
{
#if defined (USE_MDR32F1QI)
    uint32_t temp = 0;
#endif
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
    *(__IO uint32_t *) HSION_BB = (uint32_t)NewState;
#endif

#if defined (USE_MDR32F1QI)

    temp = MDR_BKP->REG_0F;
    /* Form new value */
    if (NewState != DISABLE)
    {
        /* Enable HSI clk by setting the HSE_ON bit in the BKP_REG_0F register */
        temp |= BKP_REG_0F_HSI_ON;
    }
    else
    {
        /* Disable HSI clk by resetting the HSE_ON bit in the BKP_REG_0F register */
        temp &= ~BKP_REG_0F_HSI_ON;
    }
    /* Configure REG_0F register with new value */
    MDR_BKP->REG_0F = temp;
#endif /* defined (USE_MDR32F1QI) */
}

/**
  * @brief  HSI clock frequency adjustment by HSITRIM setting
  * @param  HSItrimValue: HSI frequency trim value.
  *         This parameter must be a number between 0 and 0x3F.
  * @retval None
  */
void RST_CLK_HSIadjust(uint32_t HSItrimValue)
{
    uint32_t temp;
    /* Check the parameters */
    assert_param(IS_RCC_CLK_HSI_TRIM_VALUE(HSItrimValue));

    temp = MDR_BKP->REG_0F;

    /* Clear HSITRIM[5:0] bits */
    temp &= ~HSITRIM_MASK;

    /* Set the HSITRIM[5:0] bits according to HSItrimValue value */
    temp |= (uint32_t)HSItrimValue << HSITRIM_OFFSET;

