ogneyar/ArduinoProjects/Keil/11/RTE/Device/MDR32F9Q2I/MDR32FxQI_rst_clk.c
    /* Wait until CPUPLL is ready or time out is occure */
    do {
        flag = RST_CLK_GetFlagStatus(RST_CLK_FLAG_PLLCPURDY);
        startCounter++;
    } while ((startCounter < PLLCPUonTimeOut) && (flag == RESET));

    if (RST_CLK_GetFlagStatus(RST_CLK_FLAG_PLLCPURDY) != RESET)
    {
        state = SUCCESS;
    }
    else
    {
        state = ERROR;
    }

    return state;
}

/**
  * @brief  Сonfigures the CPU_C3_SEL division factor switch.
  * @param  CPUclkDivValue - @ref RST_CLK_CPU_C3_Divisor - specifies the CPU_PLL clock division factor.
  * @retval None
  */
void RST_CLK_CPUclkPrescaler(RST_CLK_CPU_C3_Divisor CPUclkDivValue)
{
    uint32_t temp;

    /* Check the parameters */
    assert_param(IS_RST_CLK_CPUclkDIV(CPUclkDivValue));

    temp = MDR_RST_CLK->CPU_CLOCK;
    /* Clear CPU_C3_SEL bits */
    temp &= CPU_C3_SELclr;
    /* Set the CPU_C3_SEL bits */
    temp |= ((uint32_t)CPUclkDivValue << RST_CLK_CPU_CLOCK_CPU_C3_SEL_Pos);

    /* Store the new value */
    MDR_RST_CLK->CPU_CLOCK = temp;
}

/**
  * @brief  Select the CPU clock source.
  * @param  CPU_CLK - @ref RST_CLK_HCLK_Source - specifies the CPU clock source.
  * @retval None
  */
void RST_CLK_CPUclkSelection(RST_CLK_HCLK_Source CPU_CLK)
{
    uint32_t temp;

    /* Check the parameters */
    assert_param(IS_RST_CPU_CLK(CPU_CLK));

    temp = MDR_RST_CLK->CPU_CLOCK;
    /* Clear CPU_C3_SEL bits */
    temp &= CPU_HCLK_SELclr;
    /* Set the CPU_C3_SEL bits */
    temp |= (uint32_t)CPU_CLK;

    /* Store the new value */
    MDR_RST_CLK->CPU_CLOCK = temp;
}

/**
  * @brief  Configures the USB_PLL clock source and multiplication factor.
  * @param  RST_CLK_USB_PLLsource - @ref RST_CLK_USB_PLL_Source - specifies the PLL entry clock source.
  * @param  RST_CLK_USB_PLLmul - @ref RST_CLK_USB_PLL_Multiplier - specifies the PLL multiplication factor.
  * @retval None
  */
void RST_CLK_USB_PLLconfig(RST_CLK_USB_PLL_Source RST_CLK_USB_PLLsource, uint32_t RST_CLK_USB_PLLmul)
{
    uint32_t temp;

    /* Check the parameters */
    assert_param(IS_RST_CLK_USB_PLL_SOURCE(RST_CLK_USB_PLLsource));
    assert_param(IS_RST_CLK_USB_PLL_MUL(RST_CLK_USB_PLLmul));

    /* Select USBPLL source */
    temp = MDR_RST_CLK->USB_CLOCK;
    /* Clear USB_C1_SEL bits */
    temp &= USB_C1_SELclr;
    /* Set the USB_C1_SEL bits */
    temp |= RST_CLK_USB_PLLsource;
    /* Store the new value */
    MDR_RST_CLK->USB_CLOCK = temp;

    /* Set USBPLL multiplier */
    temp = MDR_RST_CLK->PLL_CONTROL;
    /* Clear PLLMUL[3:0] bits */
    temp &= PLLUSBmulclr;
    /* Set the PLLMUL[3:0] bits */
    temp |= ((uint32_t)RST_CLK_USB_PLLmul << PLLUSBMUL_OFFSET);
    /* Store the new value */
    MDR_RST_CLK->PLL_CONTROL = temp;

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
    if (*(__IO uint32_t *) PLLUSBON_BB)
    {
        *(__IO uint32_t *) PLLUSBRLD_BB = (uint32_t) 0x01;
        *(__IO uint32_t *) PLLUSBRLD_BB = (uint32_t) 0x00;
    }
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */

#if defined (USE_MDR32F1QI)
    if ( MDR_RST_CLK->PLL_CONTROL & (RST_CLK_PLL_CONTROL_PLL_USB_ON) )
    {
        temp = MDR_RST_CLK->PLL_CONTROL;
        temp |= RST_CLK_PLL_CONTROL_PLL_USB_RLD;
        MDR_RST_CLK->PLL_CONTROL = temp;
        temp &= ~RST_CLK_PLL_CONTROL_PLL_USB_RLD;
        MDR_RST_CLK->PLL_CONTROL = temp;
    }
#endif /* #if defined (USE_MDR32F1QI)*/
}

/**
  * @brief  Select the USBPLL output as input for USB_C3_SEL or bypass the USB_PLL.
  * @param  UsePLL - @ref FunctionalState - usage state of the USB_PLL.
  * @retval None
  */
void RST_CLK_USB_PLLuse(FunctionalState UsePLL)
{
#if defined (USE_MDR32F1QI)
    uint32_t temp = 0;
#endif /* #if defined (USE_MDR32F1QI) */
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(UsePLL));

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
    *(__IO uint32_t *) USB_C2_SEL_BB = (uint32_t) UsePLL;
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */

#if defined (USE_MDR32F1QI)
    temp = MDR_RST_CLK->USB_CLOCK;

    /* Form new value */
    if (UsePLL != DISABLE)
    {
        /* Use the USB PLL output as input for USB_C3_SEL
        * by setting the USB_C2_SEL bit in the USB_CLOCK register */
        temp |= (1 << RST_CLK_USB_CLOCK_USB_C2_SEL_Pos);
    }
    else
    {
        /* Use the USB_C1 output as input for USB_C3_SEL
        * by resetting the USB_C2_SEL bit in the USB_CLOCK register */
        temp &= ~(1 << RST_CLK_USB_CLOCK_USB_C2_SEL_Pos);
    }

    /* Configure USB_CLOCK register with new value */
    MDR_RST_CLK->USB_CLOCK = temp;
#endif /* #if defined (USE_MDR32F1QI) */
}

/**
  * @brief  Enables or disables the USB_PLL.
  * @param  NewState - @ref FunctionalState - new state of the USB_PLL.
  * @retval None
  */
void RST_CLK_USB_PLLcmd(FunctionalState NewState)
{
#if defined (USE_MDR32F1QI)
    uint32_t temp = 0;
#endif /* #if defined (USE_MDR32F1QI) */
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));
#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
    *(__IO uint32_t *) PLLUSBON_BB = (uint32_t) NewState;
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */

#if defined (USE_MDR32F1QI)
    temp = MDR_RST_CLK->PLL_CONTROL;

    /* Form a new value */
    if(NewState != DISABLE)
    {
        temp |= RST_CLK_PLL_CONTROL_PLL_USB_ON;
    }
    else
    {
        temp &= ~RST_CLK_PLL_CONTROL_PLL_USB_ON;
    }

    MDR_RST_CLK->PLL_CONTROL = temp;
#endif /* #if defined (USE_MDR32F1QI) */
}

/**
  * @brief  USB_PLL status
  * @param  None
  * @retval @ref ErrorStatus: SUCCESS if USB_PLL output clock is ready, else ERROR
  */
ErrorStatus RST_CLK_USB_PLLstatus(void)
{
    __IO uint32_t startCounter = 0;
    ErrorStatus state;
    FlagStatus flag;

    /* Wait until USBPLL is ready or time out is occure */
    do {
        flag = RST_CLK_GetFlagStatus(RST_CLK_FLAG_PLLUSBRDY);
        startCounter++;
    } while ((startCounter < PLLUSBonTimeOut) && (flag == RESET));

    if (RST_CLK_GetFlagStatus(RST_CLK_FLAG_PLLUSBRDY) != RESET)
    {
        state = SUCCESS;
    }
    else
    {
        state = ERROR;
    }

    return state;
}

/**
  * @brief  Enables or disables the USB_CLK prescaler.
  * @param  NewState - @ref FunctionalState - new state of the USB_CLK prescaler.
  *             @arg ENABLE: USB_C2 divided by 2
  *             @arg DISABLE: USB_C2 not divided
  * @retval None
  */
void RST_CLK_USBclkPrescaler(FunctionalState NewState)
{
#if defined (USE_MDR32F1QI)
    uint32_t temp = 0;
#endif /* #if defined (USE_MDR32F1QI) */
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
    *(__IO uint32_t *) USB_C3_SEL_BB = (uint32_t)NewState;
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */

#if defined (USE_MDR32F1QI)
    temp = MDR_RST_CLK->USB_CLOCK;

    /* Form new value */
    if (NewState != DISABLE)
    {
        /* Enable the USB prescaler by setting the USB_C3_SEL bit in the USB_CLOCK register */
        temp |= (1 << RST_CLK_USB_CLOCK_USB_C3_SEL_Pos);
    }
    else
    {
        /* Disable the USB prescaler by resetting the USB_C3_SEL bit in the USB_CLOCK register */
        temp &= ~(1 << RST_CLK_USB_CLOCK_USB_C3_SEL_Pos);
    }
    /* Configure USB_CLOCK register with new value */
    MDR_RST_CLK->USB_CLOCK = temp;
#endif /* #if defined (USE_MDR32F1QI) */

