ogneyar/ArduinoProjects/Keil/11/RTE/Device/MDR32F9Q2I/MDR32FxQI_rst_clk.c
}

/**
  * @brief  Enables or disables the USB_CLK clock.
  * @param  NewState - @ref FunctionalState - new state of the USB_CLK.
  * @retval None
  */
void RST_CLK_USBclkEnable(FunctionalState NewState)
{
#if  defined (USE_MDR32F1QI)
    uint32_t temp = 0;
#endif /* #if defined (USE_MDR32F1QI) */
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
    *(__IO uint32_t *) USB_CLK_EN_BB = (uint32_t) NewState;
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */

#if defined (USE_MDR32F1QI)
    temp = MDR_RST_CLK->USB_CLOCK;

    /* Form new value */
    if (NewState != DISABLE)
    {
        /* Enable the USB clk by setting the USB_CLK_EN bit in the USB_CLOCK register */
        temp |= (1 << RST_CLK_USB_CLOCK_USB_CLK_EN_Pos);
    }
    else
    {
        /* Disable the USB clk by resetting the USB_CLK_EN bit in the USB_CLOCK register */
        temp &= ~(1 << RST_CLK_USB_CLOCK_USB_CLK_EN_Pos);
    }

    /* Configure USB_CLOCK register with new value */
    MDR_RST_CLK->USB_CLOCK = temp;
#endif /* #if defined (USE_MDR32F1QI) */
}

/**
  * @brief  Select the ADC clock source.
  * @param  ADC_CLK - @ref RST_CLK_ADC_Source - specifies the ADC_C2 clock source.
  * @retval None
  */
void RST_CLK_ADCclkSelection(RST_CLK_ADC_Source ADC_CLK)
{
    uint32_t temp;

    /* Check the parameters */
    assert_param(IS_RST_CLK_ADCclk(ADC_CLK));

    /* Select ADC_CLK source */
    temp = MDR_RST_CLK->ADC_MCO_CLOCK;
    /* Clear ADC_C1,C2 SEL bits */
    temp &= ADC_C12_SELclr;
    /* Set the ADC_C1,C2 SEL bits */
    temp |= ((uint32_t)ADC_CLK);

    /* Store the new value */
    MDR_RST_CLK->ADC_MCO_CLOCK = temp;
}

/**
  * @brief  Сonfigures the ADC_C3_SEL division factor switch.
  * @param  ADCclkDivValue - @ref RST_CLK_ADC_C3_Divisor - specifies the ADC_C2 clock division factor.
  * @retval None
  */
void RST_CLK_ADCclkPrescaler(RST_CLK_ADC_C3_Divisor ADCclkDivValue)
{
    uint32_t temp;

    /* Check the parameters */
    assert_param(IS_RST_CLK_ADCclkDivValue(ADCclkDivValue));

    temp = MDR_RST_CLK->ADC_MCO_CLOCK;
    /* Clear ADC_C3_SEL bits */
    temp &= ADC_C3_SELclr;
    /* Set the ADC_C3_SEL bits */
    temp |= (uint32_t)ADCclkDivValue << ADC_C3_SEL_OFFSET;

    /* Store the new value */
    MDR_RST_CLK->ADC_MCO_CLOCK = temp;
}

/**
  * @brief  Enables or disables the ADC_CLK clock.
  * @param  NewState - @ref FunctionalState - new state of the ADC_CLK.
  * @retval None
  */
void RST_CLK_ADCclkEnable(FunctionalState NewState)
{
#if defined (USE_MDR32F1QI)
    uint32_t temp = 0;
#endif /* #if defined (USE_MDR32F1QI) */
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
    *(__IO uint32_t *) ADC_CLK_EN_BB = (uint32_t) NewState;
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */

#if defined (USE_MDR32F1QI)
    temp = MDR_RST_CLK->ADC_MCO_CLOCK;

    /* Form new value */
    if (NewState != DISABLE)
    {
        /* Enable the ADC CLK by setting the ADC_CLK_EN bit in the ADC_MCO_CLOCK register */
        temp |= RST_CLK_ADC_MCO_CLOCK_ADC_CLK_EN;
    }
    else
    {
        /* Disable the ADC CLK by resetting the ADC_CLK_EN bit in the ADC_MCO_CLOCK register */
        temp &= ~RST_CLK_ADC_MCO_CLOCK_ADC_CLK_EN;
    }

    /* Configure CPU_CLOCK register with new value */
    MDR_RST_CLK->ADC_MCO_CLOCK = temp;
#endif /* #if defined (USE_MDR32F1QI) */
}

/**
  * @brief  Configures the HSI_C1_SEL division factor switch.
  * @param  HSIclkDivValue - @ref RST_CLK_HSI_C1_Divisor - specifies the HSI clock division factor.
  * @retval None
  */
void RST_CLK_HSIclkPrescaler(RST_CLK_HSI_C1_Divisor HSIclkDivValue)
{
    uint32_t temp;

    /* Check the parameters */
    assert_param(IS_RST_CLK_HSIclkDivValue(HSIclkDivValue));

    temp = MDR_RST_CLK->RTC_CLOCK;
    /* Clear HSI_SEL bits */
    temp &= HSI_SELclr;
    /* Set the HSI_SEL bits */
    temp |= (uint32_t)HSIclkDivValue << HSI_SEL_OFFSET;

    /* Store the new value */
    MDR_RST_CLK->RTC_CLOCK = temp;
}

/**
  * @brief  Enables or disables the RTCHSI clock.
  * @param  NewState - @ref FunctionalState - new state of the HSI_RTC_EN.
  * @retval None
  */
void RST_CLK_RTC_HSIclkEnable(FunctionalState NewState)
{
#if defined (USE_MDR32F1QI)
    uint32_t temp = 0;
#endif /* #if defined (USE_MDR32F1QI) */
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
    *(__IO uint32_t *) HSI_RTC_EN_BB = (uint32_t) NewState;
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */

#if defined (USE_MDR32F1QI)
    temp = MDR_RST_CLK->RTC_CLOCK;

    /* Form new value */
    if (NewState != DISABLE)
    {
        /* Enable HSI RTC clk by setting the HSE_RTC_EN bit in the RTC_CLOCK register */
        temp |= RST_CLK_RTC_CLOCK_HSI_RTC_EN;
    }
    else
    {
        /* Disable HSI RTC clk by resetting the HSE_RTC_EN bit in the RTC_CLOCK register */
        temp &= ~RST_CLK_RTC_CLOCK_HSI_RTC_EN;
    }

    /* Configure RTC_CLOCK register with new value */
    MDR_RST_CLK->RTC_CLOCK = temp;
#endif /* #if defined (USE_MDR32F1QI) */
}

/**
  * @brief  Configures the HSE_C1_SEL division factor switch.
  * @param  HSEclkDivValue - @ref RST_CLK_HSE_C1_Divisor - specifies the HSE clock division factor.
  * @retval None
  */
void RST_CLK_HSEclkPrescaler(RST_CLK_HSE_C1_Divisor HSEclkDivValue)
{
    uint32_t temp;

    /* Check the parameters */
    assert_param(IS_RST_CLK_HSEclkDivValue(HSEclkDivValue));

    temp = MDR_RST_CLK->RTC_CLOCK;
    /* Clear HSE_SEL bits */
    temp &= HSE_SELclr;
    /* Set the HSE_SEL bits */
    temp |= (uint32_t)HSEclkDivValue << HSE_SEL_OFFSET;

    /* Store the new value */
    MDR_RST_CLK->RTC_CLOCK = temp;
}

/**
  * @brief  Enables or disables the RTCHSE clock.
  * @param  NewState - @ref FunctionalState - new state of the HSE_RTC_EN.
  * @retval None
  */
void RST_CLK_RTC_HSEclkEnable(FunctionalState NewState)
{
#if defined (USE_MDR32F1QI)
    uint32_t temp = 0;
#endif /* #if defined (USE_MDR32F1QI) */
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
    *(__IO uint32_t *) HSE_RTC_EN_BB = (uint32_t)NewState;
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */

#if defined (USE_MDR32F1QI)
    temp = MDR_RST_CLK->RTC_CLOCK;

    /* Form new value */
    if (NewState != DISABLE)
    {
        /* Enable HSI RTC clk by setting the HSE_RTC_EN bit in the RTC_CLOCK register */
        temp |= RST_CLK_RTC_CLOCK_HSE_RTC_EN;
    }
    else
    {
        /* Disable HSI RTC clk by resetting the HSE_RTC_EN bit in the RTC_CLOCK register */
        temp &= ~RST_CLK_RTC_CLOCK_HSE_RTC_EN;
    }

    /* Configure RTC_CLOCK register with new value */
    MDR_RST_CLK->RTC_CLOCK = temp;
#endif /* #if defined (USE_MDR32F1QI) */
}

/**
  * @brief  Select the CPU clock source.
  * @param  CPU_CLK - @ref RST_CLK_CPU_C1_Source - specifies the CPU clock source.
  * @retval None
  */
void RST_CLK_CPUclkSelectionC1(RST_CLK_CPU_C1_Source CPU_CLK)
{
    uint32_t temp;

    /* Check the parameters */
    assert_param(IS_RST_CLK_CPU_C1_SOURCE(CPU_CLK));

    temp = MDR_RST_CLK->CPU_CLOCK;
    /* Clear CPU_C3_SEL bits */
    temp &= CPU_C1_SELclr;
    /* Set the CPU_C3_SEL bits */
    temp |= (uint32_t)CPU_CLK;

