ogneyar/ArduinoProjects/Keil/11/RTE/Device/MDR32F9Q2I/MDR32FxQI_rst_clk.c
    /* Store the new value */
    MDR_RST_CLK->CPU_CLOCK = temp;
}

/**
  * @brief  Enables or disables clock of peripherals.
  * @param  RST_CLK_PCLK: specifies the peripheral to gates its clock.
  *         This parameter can be any combination of the following values:
  *           @note for MDR32F9Q2I:
  *           @arg RST_CLK_PCLK_RST_CLK, RST_CLK_PCLK_EEPROM, RST_CLK_PCLK_DMA,
  *                RST_CLK_PCLK_CAN1,    RST_CLK_PCLK_CAN2,
  *                RST_CLK_PCLK_UART1,   RST_CLK_PCLK_UART2,  RST_CLK_PCLK_SSP1, RST_CLK_PCLK_SSP2,
  *                RST_CLK_PCLK_USB,     RST_CLK_PCLK_I2C,    RST_CLK_PCLK_EBC,
  *                RST_CLK_PCLK_WWDG,    RST_CLK_PCLK_IWDG,   RST_CLK_PCLK_BKP,  RST_CLK_PCLK_POWER,
  *                RST_CLK_PCLK_TIMER1,  RST_CLK_PCLK_TIMER2, RST_CLK_PCLK_TIMER3,
  *                RST_CLK_PCLK_ADC,     RST_CLK_PCLK_DAC,    RST_CLK_PCLK_COMP,
  *                RST_CLK_PCLK_PORTA,   RST_CLK_PCLK_PORTB,  RST_CLK_PCLK_PORTC,
  *                RST_CLK_PCLK_PORTD,   RST_CLK_PCLK_PORTE,  RST_CLK_PCLK_PORTF.
  *           @note for MDR32FG16S1QI:
  *           @arg RST_CLK_PCLK_RST_CLK, RST_CLK_PCLK_EEPROM, RST_CLK_PCLK_DMA,
  *                RST_CLK_PCLK_UART1,   RST_CLK_PCLK_UART2,  RST_CLK_PCLK_UART3,
  *                RST_CLK_PCLK_SSP1,    RST_CLK_PCLK_SSP2,   RST_CLK_PCLK_SSP3, RST_CLK_PCLK_SSP4,
  *                RST_CLK_PCLK_USB,     RST_CLK_PCLK_I2C,    RST_CLK_PCLK_EBC,  RST_CLK_PCLK_SDIO,
  *                RST_CLK_PCLK_WWDG,    RST_CLK_PCLK_IWDG,   RST_CLK_PCLK_BKP,  RST_CLK_PCLK_POWER,
  *                RST_CLK_PCLK_TIMER1,  RST_CLK_PCLK_TIMER2, RST_CLK_PCLK_TIMER3,
  *                RST_CLK_PCLK_ADC,     RST_CLK_PCLK_DAC,    RST_CLK_PCLK_COMP, RST_CLK_PCLK_AUDIO_IP,
  *                RST_CLK_PCLK_PORTA,   RST_CLK_PCLK_PORTB,  RST_CLK_PCLK_PORTC,
  *                RST_CLK_PCLK_PORTD,   RST_CLK_PCLK_PORTE,  RST_CLK_PCLK_PORTF.
  *           @note for MDR32F1QI:
  *           @arg RST_CLK_PCLK_RST_CLK,       RST_CLK_PCLK_EEPROM, RST_CLK_PCLK_DMA,
  *                RST_CLK_PCLK_CAN1,          RST_CLK_PCLK_CAN2,
  *                RST_CLK_PCLK_UART1,         RST_CLK_PCLK_UART2,
  *                RST_CLK_PCLK_SSP1,          RST_CLK_PCLK_SSP2,   RST_CLK_PCLK_SSP3,
  *                RST_CLK_PCLK_USB,           RST_CLK_PCLK_EBC,
  *                RST_CLK_PCLK_MIL_STD_15531, RST_CLK_PCLK_MIL_STD_15532,
  *                RST_CLK_PCLK_ARINC429R,     RST_CLK_PCLK_ARINC429T,
  *                RST_CLK_PCLK_WWDG,          RST_CLK_PCLK_IWDG,   RST_CLK_PCLK_BKP,    RST_CLK_PCLK_POWER,
  *                RST_CLK_PCLK_TIMER1,        RST_CLK_PCLK_TIMER2, RST_CLK_PCLK_TIMER3, RST_CLK_PCLK_TIMER4,
  *                RST_CLK_PCLK_ADC,           RST_CLK_PCLK_DAC,
  *                RST_CLK_PCLK_PORTA,         RST_CLK_PCLK_PORTB,  RST_CLK_PCLK_PORTC,
  *                RST_CLK_PCLK_PORTD,         RST_CLK_PCLK_PORTE,  RST_CLK_PCLK_PORTF.
  * @param  NewState - @ref FunctionalState - new state of the specified peripheral clock.
  * @retval None
  */
void RST_CLK_PCLKcmd(uint32_t RST_CLK_PCLK, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    assert_param(IS_RST_CLK_PCLK(RST_CLK_PCLK));

    if (NewState != DISABLE)
    {
        MDR_RST_CLK->PER_CLOCK |= RST_CLK_PCLK;
    }
    else
    {
        MDR_RST_CLK->PER_CLOCK &= ~RST_CLK_PCLK;
    }
}


#if defined (USE_MDR32FG16S1QI)
/**
  * @brief   Set the RST_CLK_AUC clock configuration to the default reset state.
  * @warning This function can be used only for MCU MDR32FG16S1QI.
  * @param   None.
  * @retval  None.
  */
void RST_CLK_AUCclkDeInit(void)
{
    MDR_RST_CLK->ADC_MCO_CLOCK &= ~(RST_CLK_ADC_MCO_CLOCK_AUC_C1_SEL_Msk |
                                    RST_CLK_ADC_MCO_CLOCK_AUC_C2_SEL_Msk |
                                    RST_CLK_ADC_MCO_CLOCK_AUC_C3_SEL_Msk |
                                    RST_CLK_ADC_MCO_CLOCK_AUC_CLK_EN);
}

/**
  * @brief   Select the AUC clock source.
  * @warning This function can be used only for MCU MDR32FG16S1QI.
  * @param   AUC_CLK - @ref RST_CLK_AUC_Source - specifies the AUC_C1 clock source.
  * @retval  None
  */
void RST_CLK_AUCclkSelection(RST_CLK_AUC_Source AUC_CLK)
{
    uint32_t temp = 0;

    /* Check the parameters */
    assert_param(IS_RST_CLK_AUCclk(AUC_CLK));

    /* Select ADC_CLK source */
    temp = MDR_RST_CLK->ADC_MCO_CLOCK;
    /* Clear AUC_C1,C2 SEL bits */
    temp &= AUC_C12_SELclr;
    /* Set the ADC_C1,C2 SEL bits */
    temp |= (uint32_t)AUC_CLK;

    /* Store the new value */
    MDR_RST_CLK->ADC_MCO_CLOCK = temp;
}

/**
  * @brief   Configures the AUC_C3_SEL division factor switch.
  * @warning This function can be used only for MCU MDR32FG16S1QI.
  * @param   AUCclkDIVValue - @ref RST_CLK_AUC_C3_Divisor - specifies the AUC_VIV clock division factor.
  * @retval  None
  */
void RST_CLK_AUCclkPrescaler(RST_CLK_AUC_C3_Divisor AUCclkDIVValue)
{
    uint32_t temp = 0;

    /* Check the parameters */
    assert_param(IS_RST_CLK_AUCclkDIV(AUCclkDIVValue));

    temp = MDR_RST_CLK->ADC_MCO_CLOCK;
    /* Clear CPU_C3_SEL bits */
    temp &= AUC_C3_SELclr;
    /* Set the CPU_C3_SEL bits */
    temp |= (uint32_t)AUCclkDIVValue;

    /* Store the new value */
    MDR_RST_CLK->ADC_MCO_CLOCK = temp;
}

/**
  * @brief   Enables or disables the AUC clk.
  * @warning This function can be used only for MCU MDR32FG16S1QI.
  * @param   NewState - @ref FunctionalState - new state of the AUC clk.
  * @retval  None
  */
void RST_CLK_AUCclkCMD(FunctionalState NewState)
{
    uint32_t temp = 0;

    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    temp = MDR_RST_CLK->ADC_MCO_CLOCK;

    /* Form new value */
    if (NewState != DISABLE)
    {
        /* Enable AUC clk by setting the AUC_CLK_EN bit in the ADC_MCO_CLOCK register */
        temp |= RST_CLK_ADC_MCO_CLOCK_AUC_CLK_EN;
    }
    else
    {
        /* Disable AUC clk by resetting the AUC_CLK_EN bit in the ADC_MCO_CLOCK register */
        temp &= ~RST_CLK_ADC_MCO_CLOCK_AUC_CLK_EN;
    }

    /* Configure ADC_MCO_CLOCK register with new value */
    MDR_RST_CLK->ADC_MCO_CLOCK = temp;
}
#endif /* #if defined (USE_MDR32FG16S1QI) */

/**
  * @brief  Put the frequencies of different on chip clocks in *RST_CLK_Clocks structure.
  * @param  RST_CLK_Clocks: pointer to a @ref RST_CLK_ClocksTypeDef structure that will hold
  *         the clocks frequencies.
  * @retval None
  */
void RST_CLK_GetClocksFreq(RST_CLK_FreqTypeDef* RST_CLK_Clocks)
{
    uint32_t cpu_c1_freq, cpu_c2_freq, cpu_c3_freq;
    uint32_t usb_c1_freq, usb_c2_freq, usb_c3_freq;
    uint32_t adc_c1_freq, adc_c2_freq, adc_c3_freq;
    uint32_t hsi_c1_freq, hse_c1_freq;
    uint32_t pll_mul;
    uint32_t temp;

    /* Check the parameter */
    assert_param(RST_CLK_Clocks != 0);

    /* Compute CPU_CLK, USB_CLK, ADC_CLK, RTCHSI, RTCHSE clocks frequencies */

    /* Compute CPU_CLK frequency */

    /* Determine CPU_C1 frequency */
    if( MDR_RST_CLK->CPU_CLOCK & (2 << RST_CLK_CPU_CLOCK_CPU_C1_SEL_Pos) )
    {
        cpu_c1_freq = HSE_Value;
    }
    else
    {
        cpu_c1_freq = HSI_Value;
    }

