ogneyar/ArduinoProjects/Keil/11/RTE/Device/MDR32F9Q2I/MDR32FxQI_rst_clk.c
    tmpreg |= (uint32_t)DSP_CLK_Source;

    MDR_RST_CLK->DSP_CLOCK = tmpreg;
}


/**
  * @brief   Configures the DSP_PLL multiplication factor.
  * @warning This function can be used only for MCU MDR32FG16S1QI.
  * @param   PLLMul - @ref RST_CLK_DSP_PLL_Multiplier - specifies the PLL multiplication factor.
  * @retval  None.
  */
void RST_CLK_DSPPLLConfig(RST_CLK_DSP_PLL_Multiplier DSP_PLL_Mul)
{
    uint32_t tmpreg;
    /* Check the parameters */
    assert_param(IS_DSP_PLL_MULL(DSP_PLL_Mul));

    tmpreg = MDR_RST_CLK->PLL_CONTROL & (~RST_CLK_PLL_CONTROL_PLL_DSP_MUL_Msk);

    tmpreg |= (uint32_t)DSP_PLL_Mul << RST_CLK_PLL_CONTROL_PLL_DSP_MUL_Pos;

    MDR_RST_CLK->PLL_CONTROL = tmpreg;

    if (*(__IO uint32_t *) PLL_DSP_ON_BB)
    {
        *(__IO uint32_t *) PLL_DSP_RLD_BB = (uint32_t)0x01;
        *(__IO uint32_t *) PLL_DSP_RLD_BB = (uint32_t)0x00;
    }
}

/**
  * @brief   Enable or disable the DSP PLL.
  * @warning This function can be used only for MCU MDR32FG16S1QI.
  * @param   NewState - @ref FunctionalState - the new state of the DSP PLL.
  * @retval  None
  */
void RST_CLK_DSPPLL_CMD(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    *(__IO uint32_t *)PLL_DSP_ON_BB = (uint32_t)NewState;
}

/**
  * @brief   Get DSP_PLL status
  * @warning This function can be used only for MCU MDR32FG16S1QI.
  * @param   None
  * @retval  @ref ErrorStatus - SUCCESS if DSP_PLL output clock is ready, else ERROR.
  */
ErrorStatus RST_CLK_DSP_PLLStatus(void)
{
    __IO uint32_t startCounter = 0;
    ErrorStatus state;
    FlagStatus flag;

    /* Wait until DSPPLL is ready or time out is occure */
    do {
        flag = RST_CLK_GetFlagStatus(RST_CLK_FLAG_PLLDSPRDY);
        startCounter++;
    } while ((startCounter < PLLDSPonTimeOut) && (flag == RESET));

    if (RST_CLK_GetFlagStatus(RST_CLK_FLAG_PLLDSPRDY) != RESET)
    {
        state = SUCCESS;
    }
    else
    {
        state = ERROR;
    }

    return state;
}

/**
  * @brief   Select the DSP_PLL output as input for DSP_C3_SEL or bypass the CPU_PLL.
  * @warning This function can be used only for MCU MDR32FG16S1QI.
  * @param   UsePLL - @ref FunctionalState - usage state of the DSP_PLL.
  * @retval  None
  */
void RST_CLK_DSP_PLLUse(FunctionalState UsePLL)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(UsePLL));

    *(__IO uint32_t *) DSP_CLK_C2_SEL_BB = (uint32_t) UsePLL;
}


/**
  * @brief   Use DSP_C2  or DSP_C2/2 output as DSP_CLK.
  * @warning This function can be used only for MCU MDR32FG16S1QI.
  * @param   DSP_Prescaler - @ref RST_CLK_DSP_C3_Divisor - enables or disables halving the DSP_C2 output clock.
  * @retval  None
  */
void RST_CLK_DSPPrescaler(RST_CLK_DSP_C3_Divisor DSP_Prescaler)
{
    /* Check the parameters */
    assert_param(IS_DSP_PRESCALER(DSP_Prescaler));

    *(__IO uint32_t *) DSP_CLK_C3_SEL_BB = (uint32_t) DSP_Prescaler;
}

/**
  * @brief   Enable or disable DSP clock.
  * @warning This function can be used only for MCU MDR32FG16S1QI.
  * @param   NewState - @ref FunctionalState - New state of the DSP CLK.
  * @retval  None
  */
void RST_CLK_DSPCmd(FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    /* Set the new state of the DSP CLK bit */
    *(__IO uint32_t *) DSP_CLK_EN_BB = (uint32_t) NewState;
}
#endif /* #if defined (USE_MDR32FG16S1QI) */

/** @} */ /* End of group RST_CLK_Private_Functions */

/** @} */ /* End of group RST_CLK */

/** @} */ /* End of group __MDR32FxQI_StdPeriph_Driver */

/*********************** (C) COPYRIGHT 2022 Milandr ****************************
*
* END OF FILE MDR32FxQI_rst_clk.c */


